# -*- coding: UTF-8 -*-

# ------------------------(max to 80 columns)-----------------------------------
# author by : （学员ID)
# created:  2019.7.10

# Description:
#   学习理解 二进制，八进制， 十进制
# ------------------------(max to 80 columns)-----------------------------------


num = 65535

# 输出方式 一
print('-----------------------------------')
print('-- 2进制： {:b}'.format(num))
print('-- 8进制： %o' % num)
print('-- 10进制： %d' % num)
print('-- 16进制： %x' % num)

# 输出方式 一
print('-----------------------------------')
print('-- 2进制： ', bin(num))
print('-- 8进制： ', oct(num))
print('-- 10进制：', num)
print('-- 16进制：', hex(num))
